Revit 2027 API
TextEditorOptions Methods
The TextEditorOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTextEditorOptions |  Returns the current Revit instance's TextEditorOptions.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
TextEditorOptions Class
Autodesk.Revit.UI Namespace